Importing libraries

In [1]:
import atoti as tt
import pandas as pd
import numpy as np

Welcome to atoti 0.7.1!

By using this community edition, you agree with the license available at https://docs.atoti.io/latest/eula.html.
Browse the official documentation at https://docs.atoti.io.
Join the community at https://www.atoti.io/register.

atoti collects telemetry data, which is used to help understand how to improve the product.
If you don't wish to send usage data, set the ATOTI_DISABLE_TELEMETRY environment variable to True.

You can hide this message by setting the ATOTI_HIDE_EULA_MESSAGE environment variable to True.

Load Dataset

In [2]:
df_courses = pd.read_csv('data/courses.csv')
df_studentInfo = pd.read_csv('data/studentInfo.csv')

Data Cleaning

In [3]:
df_studentInfo['id_student'] = df_studentInfo['id_student'].astype('string')
df_studentInfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   code_module           32593 non-null  object
 1   code_presentation     32593 non-null  object
 2   id_student            32593 non-null  string
 3   gender                32593 non-null  object
 4   region                32593 non-null  object
 5   highest_education     32593 non-null  object
 6   imd_band              31482 non-null  object
 7   age_band              32593 non-null  object
 8   num_of_prev_attempts  32593 non-null  int64
 9   studied_credits       32593 non-null  int64
 10  disability            32593 non-null  object
 11  final_result          32593 non-null  object
dtypes: int64(2), object(9), string(1)
memory usage: 3.0+ MB

In [4]:
nullValue = pd.DataFrame(df_studentInfo.isnull().sum().sort_values(ascending=False))
print(nullValue)

                         0
imd_band              1111
code_module              0
code_presentation        0
id_student               0
gender                   0
region                   0
highest_education        0
age_band                 0
num_of_prev_attempts     0
studied_credits          0
disability               0
final_result             0

In [5]:
nullValue2 = pd.DataFrame(df_courses.isnull().sum().sort_values(ascending=False))
print(nullValue2)

                            0
code_module                 0
code_presentation           0
module_presentation_length  0

In [6]:
##drop atribut pada table studentInfo yaitu imd_band
df_studentInfo = df_studentInfo.drop(columns='imd_band')

In [7]:
nullValue = pd.DataFrame(df_studentInfo.isnull().sum().sort_values(ascending=False))
print(nullValue)

                      0
code_module           0
code_presentation     0
id_student            0
gender                0
region                0
highest_education     0
age_band              0
num_of_prev_attempts  0
studied_credits       0
disability            0
final_result          0

In [8]:
df_courses.head()

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269
2         BBB             2013J                         268
3         BBB             2014J                         262
4         BBB             2013B                         240

In [9]:
df_studentInfo.head()

,code_module,code_presentation,id_student,gender,region,highest_education,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,0-35,0,60,N,Pass